In [70]:
import pandas as pd

In [71]:
data_file_path="../Resources/dataSet.csv"

In [72]:
data_file_pd = pd.read_csv(data_file_path)

In [73]:
data_file_pd.head()

   id First Name Last Name Gender   Amount
0   1       Todd     Lopez      M   8067.7
1   2     Joshua     White      M   7330.1
2   3       Mary     Lewis      F  16335.0
3   4      Emily     Burns      F  12460.8
4   5  Christina    Romero      F  15271.9

In [74]:
data_file_pd.describe()

                id        Amount
count  1000.000000   1000.000000
mean    500.500000  10051.323600
std     288.819436   5831.230806
min       1.000000      3.400000
25%     250.750000   4854.875000
50%     500.500000  10318.050000
75%     750.250000  15117.425000
max    1000.000000  19987.400000

In [75]:
data_file_pd.mean()["Amount"]

10051.323600000002

In [76]:
data_file_pd.sum()

id                                                       500500
First Name    ToddJoshuaMaryEmilyChristinaRaymondSandraToddA...
Last Name     LopezWhiteLewisBurnsRomeroAndrewsBakerDiazBurk...
Gender        MMFFFMFMFMMMMMMFMMMFMMFMMFFMMMMFMFMFMFFFFMFMMF...
Amount                                              1.00513e+07
dtype: object

In [77]:
#data_file_pd.unique()["Last Name"]

In [78]:
data_file_pd.count()

id            1000
First Name    1000
Last Name     1000
Gender        1000
Amount        1000
dtype: int64